Tutorial_benchmark_2_CAARC_with_MPI/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (-720 -600 0)  		//Point 0
    (1600 -600 0)		//Point 1
    (1600 600 0)		//Point 2
    (-720 600 0)		//Point 3
    (-720 -600 720)		//Point 4
    (1600 -600 720)		//Point 5
    (1600 600 720)		//Point 6
    (-720 600 720)		//Point 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (42 22 13) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    frontAndBack
    {
        type symmetry;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
